import { LayoutsKeyProps } from "../../../types/types";


// export const layouts: Record<LayoutsKeyProps, string[]> = {
// 	EN: [
// 		"`", "1", "2", "3", "4", "5", "6", "7", "8", "9", "0", "-", "=", "Backspace",
// 		"Tab", "Q", "W", "E", "R", "T", "Y", "U", "I", "O", "P", "[", "]", "\\",
// 		"CapsLock", "A", "S", "D", "F", "G", "H", "J", "K", "L", ";", "'", "Enter",
// 		"shift", "Z", "X", "C", "V", "B", "N", "M", ",", ".", "/", "Shift",
// 		"Ctrl", "Alt", "Space", "Alt", "Ctrl"
// 	],
// 	RU: [
// 		"ё", "1", "2", "3", "4", "5", "6", "7", "8", "9", "0", "-", "=", "Backspace",
// 		"Tab", "Й", "Ц", "У", "К", "Е", "Н", "Г", "Ш", "Щ", "З", "Х", "Ъ", "\\",
// 		"CapsLock", "Ф", "Ы", "В", "А", "П", "Р", "О", "Л", "Д", "Ж", "Э", "Enter",
// 		"Shift", "Я", "Ч", "С", "М", "И", "Т", "Ь", "Б", "Ю", ".", "Shift",
// 		"Ctrl", "Alt", "Space", "Alt", "Ctrl"
// 	],
// 	Enshift: [
// 		"~", "!", "@", "#", "$", "%", "^", "&", "*", "(", ")", "_", "+", "Backspace",
// 		"Tab", "Q", "W", "E", "R", "T", "Y", "U", "I", "O", "P", "{", "}", "|",
// 		"CapsLock", "A", "S", "D", "F", "G", "H", "J", "K", "L", ":", "\"", "Enter",
// 		"Shift", "Z", "X", "C", "V", "B", "N", "M", "<", ">", "?", "Shift",
// 		"Ctrl", "Alt", "Space", "Alt", "Ctrl"
// 	],
// 	Rushift: [
// 		"Ё", "!", "\"", "№", ";", "%", ":", "?", "*", "(", ")", "_", "+", "Backspace",
// 		"Tab", "Й", "Ц", "У", "К", "Е", "Н", "Г", "Ш", "Щ", "З", "Х", "Ъ", "/",
// 		"CapsLock", "Ф", "Ы", "В", "А", "П", "Р", "О", "Л", "Д", "Ж", "Э", "Enter",
// 		"Shift", "Я", "Ч", "С", "М", "И", "Т", "Ь", "Б", "Ю", ",", "Shift",
// 		"Ctrl", "Alt", "Space", "Alt", "Ctrl"
// 	]
// };



export const layouts: Record<LayoutsKeyProps, string[]> = {
	EN: [
		"~", "!", "@", "#", "$", "%", "^", "&", "*", "(", ")", "_", "+", ":", "\"", "|", "{", "}",
		"`", "1", "2", "3", "4", "5", "6", "7", "8", "9", "0", "-", "=", "backspace",
		"tab", "q", "w", "e", "r", "t", "y", "u", "i", "o", "p", "[", "]", "\\",
		"capslock", "a", "s", "d", "f", "g", "h", "j", "k", "l", ";", "'", "enter",
		"shift", "z", "x", "c", "v", "b", "n", "m", ",", ".", "/", "shift",
		"ctrl", "alt", " ", "alt", "ctrl"
	],
	RU: [
		"!", "\"", "№", ";", "%", ":", "?", "*", "(", ")", "_", "+",
		"ё", "1", "2", "3", "4", "5", "6", "7", "8", "9", "0", "-", "=", "backspace",
		"tab", "й", "ц", "у", "к", "е", "н", "г", "ш", "щ", "з", "х", "ъ", "\\",
		"capslock", "ф", "ы", "в", "а", "п", "р", "о", "л", "д", "ж", "э", "enter",
		"shift", "я", "ч", "с", "м", "и", "т", "ь", "б", "ю", ".", "shift",
		"ctrl", "alt", " ", "alt", "ctrl"
	],

};
export const layoutOrder = ["EN", "RU"];


// const shiftSymbols = {
// 	"1": "!",
// 	"2": "@",
// 	"3": "#",
// 	"4": "$",
// 	"5": "%",
// 	"6": "^",
// 	"7": "&",
// 	"8": "*",
// 	"9": "(",
// 	"0": ")"
// };



// ENSHIFT: [
// 	"~", "!", "@", "#", "$", "%", "^", "&", "*", "(", ")", "_", "+", "backspace",
// 	"tab", "q", "w", "e", "r", "t", "y", "u", "i", "o", "p", "{", "}", "|",
// 	"capslock", "a", "s", "d", "f", "g", "h", "j", "k", "l", ":", "\"", "enter",
// 	"shift", "z", "x", "c", "v", "b", "n", "m", "<", ">", "?", "shift",
// 	"ctrl", "alt", "space", "alt", "ctrl"
// ],
// RUSHIFT: [
// 	"ё", "!", "\"", "№", ";", "%", ":", "?", "*", "(", ")", "_", "+", "backspace",
// 	"tab", "й", "ц", "у", "к", "е", "н", "г", "ш", "щ", "з", "х", "ъ", "/",
// 	"capslock", "ф", "ы", "в", "а", "п", "р", "о", "л", "д", "ж", "э", "enter",
// 	"shift", "я", "ч", "с", "м", "и", "т", "ь", "б", "ю", ",", "shift",
// 	"ctrl", "alt", "space", "alt", "ctrl"
// ]