
export const Alphabets = {
	en: [...'abcdefghijklmnopqrstuvwxyz'],
	ru: [...'абвгдеёжзийклмнопрстуфхцчшщъыьэюя'],
	EN: [...'ABCDEFGHIJKLMNOPQRSTUVWXYZ'],
	RU: [...'АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ'],
	numbers: [...'0123456789'],
	marksEN: [';', "'", ':', '"', '[', ']', '{', '}', '\\', '|', ',', '.', '<', '>', '/', '?', '`', '~', '!', '@', '#', '$', '%', '^', '&', '*', '(', ')', '-', '=', '_', '+'],
	marksRU: ['!', '"', '№', ';', '%', ':', '?', '*', '(', ')', '-', '=', '_', '+', '\\', '/', '.', ',']
};
